Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:5000' }}"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Ramp up phase
    - duration: 40
      arrivalRate: 100
      name: Peak load phase
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Health API Check"
    flow:
      - get:
          url: "/health"
